OpenFOAM/foam9tutorials/tutorials/multiphase/interFoam/RAS/mixerVesselAMI/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.007;

boundaryField
{
    vessel
    {
        type            epsilonWallFunction;
        value           uniform 0.007;
    }
    oilInlet
    {
        type            fixedValue;
        value           uniform 0.007;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.007;
        value           uniform 0.007;
    }
    shaftRotating
    {
        type            epsilonWallFunction;
        value           uniform 0.007;
    }
    shaft
    {
        type            epsilonWallFunction;
        value           uniform 0.007;
    }
    sparger
    {
        type            epsilonWallFunction;
        value           uniform 0.007;
    }
    stirrer
    {
        type            epsilonWallFunction;
        value           uniform 0.007;
    }
    baffles
    {
        type            epsilonWallFunction;
        value           uniform 0.007;
    }
    AMI1
    {
        type            cyclicAMI;
        value           uniform 0;
    }
    AMI2
    {
        type            cyclicAMI;
        value           uniform 0;
    }
}


// ************************************************************************* //
